App/DataProcessors/ДневнаяНорма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ДневнаяНорма</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

App/InformationRegisters/ИзмеренияЧеловека.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИзмеренияЧеловека</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемГруди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбхватПлеча</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемТалии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

App/InformationRegisters/НормыКилокалорий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НормыКилокалорий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаКаллорий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Белки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Жиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Углеводы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньАктивности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниАктивности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозрастОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозрастДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

App/Documents/Питание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Питание</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриемПищи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриемыПищи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

App/DataProcessors/ДневнаяНорма/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДиаграмму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДиаграмму()
	
	Диаграмма.Обновление = Ложь;
	
	ДанныеДиаграммы = ПолучитьДанные(ДатаПарам);
	
	//Белки
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[0],Диаграмма.Серии[0],ДанныеДиаграммы.БелкиТекущие);
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[0],Диаграмма.Серии[1],ДанныеДиаграммы.БелкиНорма);
	//Жиры
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[1],Диаграмма.Серии[0],ДанныеДиаграммы.ЖирыТекущие);
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[1],Диаграмма.Серии[1],ДанныеДиаграммы.ЖирыНорма);
	//Углеводы
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[2],Диаграмма.Серии[0],ДанныеДиаграммы.УглеводыТекущие);
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[2],Диаграмма.Серии[1],ДанныеДиаграммы.УглеводыНорма);
	//Пищевая ценность
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[3],Диаграмма.Серии[0],ДанныеДиаграммы.ПищеваяЦенностьТекущие);
	Диаграмма.УстановитьЗначение(Диаграмма.Точки[3],Диаграмма.Серии[1],ДанныеДиаграммы.ПищеваяЦенностьНорма);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(Дата)
	
	СтруктураОтвета = Новый Структура("БелкиТекущие,ЖирыТекущие,УглеводыТекущие,ПищеваяЦенностьТекущие,БелкиНорма,ЖирыНорма,УглеводыНорма,ПищеваяЦенностьНорма");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПитаниеПродукты.Продукт.Белки * ПитаниеПродукты.Порция / ЕСТЬNULL(ПитаниеПродукты.Продукт.ЕдиницаИзмерения.Кратность, 1)) КАК Белки,
	               |	СУММА(ПитаниеПродукты.Продукт.Жиры * ПитаниеПродукты.Порция / ЕСТЬNULL(ПитаниеПродукты.Продукт.ЕдиницаИзмерения.Кратность, 1)) КАК Жиры,
	               |	СУММА(ПитаниеПродукты.Продукт.Углеводы * ПитаниеПродукты.Порция / ЕСТЬNULL(ПитаниеПродукты.Продукт.ЕдиницаИзмерения.Кратность, 1)) КАК Углеводы,
	               |	СУММА(ПитаниеПродукты.Продукт.ПищеваяЦенность * ПитаниеПродукты.Порция / ЕСТЬNULL(ПитаниеПродукты.Продукт.ЕдиницаИзмерения.Кратность, 1)) КАК ПищеваяЦенность
	               |ИЗ
	               |	Документ.Питание.Продукты КАК ПитаниеПродукты
	               |ГДЕ
	               |	ПитаниеПродукты.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Если РЗ.Количество() = 0 Тогда
		СтруктураОтвета.БелкиТекущие = 0;
		СтруктураОтвета.ЖирыТекущие = 0;
		СтруктураОтвета.УглеводыТекущие = 0;
		СтруктураОтвета.ПищеваяЦенностьТекущие = 0;
	Иначе
		ТекСтрока = РЗ.Получить(0);
		СтруктураОтвета.БелкиТекущие = ТекСтрока.Белки;
		СтруктураОтвета.ЖирыТекущие = ТекСтрока.Жиры;
		СтруктураОтвета.УглеводыТекущие = ТекСтрока.Углеводы;
		СтруктураОтвета.ПищеваяЦенностьТекущие = ТекСтрока.ПищеваяЦенность;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НормыКилокалорий.НормаКаллорий КАК НормаКаллорий,
	               |	НормыКилокалорий.Белки КАК Белки,
	               |	НормыКилокалорий.Жиры КАК Жиры,
	               |	НормыКилокалорий.Углеводы КАК Углеводы
	               |ИЗ
	               |	РегистрСведений.ИзмеренияЧеловека.СрезПоследних(&Период, ) КАК ИзмеренияЧеловекаСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НормыКилокалорий КАК НормыКилокалорий
	               |		ПО ИзмеренияЧеловекаСрезПоследних.Пользователь.Возраст >= НормыКилокалорий.ВозрастОт
	               |			И ИзмеренияЧеловекаСрезПоследних.Пользователь.Возраст <= НормыКилокалорий.ВозрастДо
	               |			И ИзмеренияЧеловекаСрезПоследних.Пользователь.Пол = НормыКилокалорий.Пол
	               |			И ИзмеренияЧеловекаСрезПоследних.Пользователь.УровеньАктивности = НормыКилокалорий.УровеньАктивности";
	
	Запрос.УстановитьПараметр("Период",Дата);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Если РЗ.Количество() = 0 Тогда
		СтруктураОтвета.БелкиНорма = 0;
		СтруктураОтвета.ЖирыНорма = 0;
		СтруктураОтвета.УглеводыНорма = 0;
		СтруктураОтвета.ПищеваяЦенностьНорма = 0;
	Иначе
		ТекСтрока = РЗ.Получить(0);
		СтруктураОтвета.БелкиНорма = ТекСтрока.Белки;
		СтруктураОтвета.ЖирыНорма = ТекСтрока.Жиры;
		СтруктураОтвета.УглеводыНорма = ТекСтрока.Углеводы;
		СтруктураОтвета.ПищеваяЦенностьНорма = ТекСтрока.НормаКаллорий;
	КонецЕсли;
				   
	Возврат СтруктураОтвета;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаПарам = ТекущаяДата();
	
	ОбновитьДиаграмму();
	
КонецПроцедуры
